app/Controllers/Admin/Dashboard.php

    public function index()
    {
        $vehicleModel = new VehicleModel();
        $routeModel = new RouteModel();
        $userModel = new UserModel();
        $logModel = new LogModel();
        $queueModel = new \App\Models\QueueModel();

        $data = [
            'title' => 'Admin Dashboard',
            'stats' => [
                'vehicles' => $vehicleModel->countAll(),
                'routes'   => $routeModel->countAll(),
                'users'    => $userModel->countAll(),
                'logs'     => $logModel->countAll()
            ],
            'queue' => $queueModel->select('queue.*, queue.estimated_departure, vehicles.plate_number, routes.origin, routes.destination, vehicles.capacity')
                                  ->join('vehicles', 'vehicles.id = queue.vehicle_id')
                                  ->join('routes', 'routes.id = queue.route_id')
                                  ->whereIn('queue.status', ['waiting', 'boarding'])
                                  ->orderBy('queue.position', 'ASC')
                                  ->findAll(),
            'recent_logs' => $logModel->select('logs.*, users.username')
                                     ->join('users', 'users.id = logs.user_id', 'left')
                                     ->orderBy('timestamp', 'DESC')
                                     ->limit(5)
                                     ->findAll(),
---
SELECT COUNT(*) AS `numrows` FROM `vehicles`
SELECT COUNT(*) AS `numrows` FROM `routes`
SELECT COUNT(*) AS `numrows` FROM `users`
SELECT COUNT(*) AS `numrows` FROM `logs`
SELECT `queue`.*, `vehicles`.`plate_number`, `routes`.`destination`, `vehicles`.`capacity`
FROM `queue`
JOIN `vehicles` ON `vehicles`.`id` = `queue`.`vehicle_id`
JOIN `routes` ON `routes`.`id` = `queue`.`route_id`
WHERE `queue`.`status` IN ('waiting','boarding')
ORDER BY `queue`.`position` ASC
SELECT `logs`.*, `users`.`username`
FROM `logs`
LEFT JOIN `users` ON `users`.`id` = `logs`.`user_id`
ORDER BY `timestamp` DESC
 LIMIT 5