app/Controllers/Admin/Routes.php

SELECT `routes`.*, `terminals`.`name` as `terminal_name`
FROM `routes`
JOIN `terminals` ON `terminals`.`id` = `routes`.`terminal_id`
---
    public function index()
    {
        // Join with terminals table to get terminal name
        $routes = $this->routeModel->select('routes.*, terminals.name as terminal_name')
                                   ->join('terminals', 'terminals.id = routes.terminal_id')
                                   ->findAll();