app/Controllers/Fares.php

    public function index()
    {
        $routeModel = new RouteModel();

        // Fetch routes grouped by vehicle type
        $van_routes = $routeModel->where('vehicle_type', 'van')->findAll();
---
SELECT *
FROM `routes`
WHERE `vehicle_type` = 'jeepney'