app/Controllers/Home.php

SELECT `queue`.*, `vehicles`.`plate_number`, `vehicles`.`owner_name`, `vehicles`.`scheduled_departure_time`, `routes`.`destination`, `queue`.`current_passengers`, `vehicles`.`capacity`
FROM `queue`
JOIN `vehicles` ON `vehicles`.`id` = `queue`.`vehicle_id`
JOIN `routes` ON `routes`.`id` = `queue`.`route_id`
WHERE `queue`.`status` IN ('waiting','boarding')
ORDER BY `queue`.`position` ASC
SELECT `queue`.*, `vehicles`.`plate_number`, `vehicles`.`owner_name`, `routes`.`destination`
FROM `queue`
JOIN `vehicles` ON `vehicles`.`id` = `queue`.`vehicle_id`
JOIN `routes` ON `routes`.`id` = `queue`.`route_id`
WHERE `queue`.`status` = 'departed'
ORDER BY `departure_time` DESC
 LIMIT 10
---
    public function index()
    {
        $queueModel1 = new QueueModel();
        $queueModel2 = new QueueModel();
        $routeModel = new \App\Models\RouteModel();
        $departureRuleModel = new DepartureRuleModel();

        $announcements = [];
        try {
            $announcementModel = new AnnouncementModel();
            $announcements = $announcementModel->where('is_active', 1)->orderBy('sort_order', 'ASC')->findAll();
        } catch (\Throwable $e) {
            // Table may not exist yet; show guest page without announcements
        }

        // Load all departure rules
        $departureRules = $departureRuleModel->orderBy('time_from', 'ASC')->findAll();

        $active_queue = $queueModel1->select('queue.*, queue.estimated_departure, vehicles.plate_number, vehicles.type as vehicle_type, routes.origin, routes.destination, queue.current_passengers, vehicles.capacity, vehicles.driver_name')
            ->join('vehicles', 'vehicles.id = queue.vehicle_id')
            ->join('routes', 'routes.id = queue.route_id')
            ->whereIn('queue.status', ['waiting', 'boarding'])
            ->orderBy('queue.position', 'ASC')
            ->findAll();



        $data = [
            'title' => 'Live Terminal Monitor',
            'active_queue' => $active_queue,
            'recent_departures' => $queueModel2->select('queue.*, vehicles.plate_number, vehicles.capacity, queue.current_passengers, vehicles.driver_name, routes.origin, routes.destination')
                ->join('vehicles', 'vehicles.id = queue.vehicle_id')
                ->join('routes', 'routes.id = queue.route_id')
                ->where('queue.status', 'departed')
                ->orderBy('queue.departure_time', 'DESC')
                ->limit(10)
                ->findAll(),