app/Controllers/Staff/Queue.php

    public function index()
    {
        // Get current queue with details
        $queue = $this->queueModel->select('queue.*, vehicles.plate_number, vehicles.type as vehicle_type, routes.origin, routes.destination, vehicles.capacity')
            ->join('vehicles', 'vehicles.id = queue.vehicle_id')
            ->join('routes', 'routes.id = queue.route_id')
            ->whereIn('queue.status', ['waiting', 'boarding'])
            ->orderBy('queue.position', 'ASC')
            ->findAll();

        $data = [
            'title' => 'Queue Management',
            'queue' => $queue,
            'vehicles' => $this->vehicleModel->where('status', 'active')->findAll(),
            'routes' => $this->routeModel->findAll()
---
SELECT `queue`.*, `vehicles`.`plate_number`, `routes`.`destination`, `vehicles`.`capacity`
FROM `queue`
JOIN `vehicles` ON `vehicles`.`id` = `queue`.`vehicle_id`
JOIN `routes` ON `routes`.`id` = `queue`.`route_id`
WHERE `queue`.`status` IN ('waiting','boarding')
ORDER BY `queue`.`position` ASC
SELECT *
FROM `vehicles`
WHERE `status` = 'active'
SELECT *
FROM `routes`